[
    {
        "question": "Has Ted Stevens represented the state of Alaska as US senator? Was Ted Stevens's alma mater MIT?"
    },
    {
        "question": "Has John McCain represented the state of Arizona as US senator? Was John McCain's alma mater MIT?"
    },
    {
        "question": "Has Tom Coburn represented the state of Arkansas as US senator? Was Tom Coburn's alma mater MIT?"
    },
    {
        "question": "Has Orrin Hatch represented the state of Colorado as US senator? Was Orrin Hatch's alma mater MIT?"
    },
    {
        "question": "Has Chris Murphy represented the state of Connecticut as US senator? Was Chris Murphy's alma mater MIT?"
    },
    {
        "question": "Has John McCain represented the state of Florida as US senator? Was John McCain's alma mater MIT?"
    },
    {
        "question": "Has John McCain represented the state of Georgia as US senator? Was John McCain's alma mater MIT?"
    },
    {
        "question": "Has Akaka represented the state of Hawaii as US senator? Was Akaka's alma mater MIT?"
    },
    {
        "question": "Has Chuck Winder represented the state of Idaho as US senator? Was Chuck Winder's alma mater MIT?"
    },
    {
        "question": "Has Tammy Baldwin represented the state of Illinois as US senator? Was Tammy Baldwin's alma mater MIT?"
    },
    {
        "question": "Has Dan Coats represented the state of Indiana as US senator? Was Dan Coats's alma mater MIT?"
    },
    {
        "question": "Has Tom Vilsack represented the state of Iowa as US senator? Was Tom Vilsack's alma mater MIT?"
    },
    {
        "question": "Has Chuck Grassley represented the state of Kansas as US senator? Was Chuck Grassley's alma mater MIT?"
    },
    {
        "question": "Has John McCain represented the state of Louisiana as US senator? Was John McCain's alma mater MIT?"
    },
    {
        "question": "Has Olympia Snowe represented the state of Maine as US senator? Was Olympia Snowe's alma mater MIT?"
    },
    {
        "question": "Has Edward Kennedy represented the state of Massachusetts as US senator? Was Edward Kennedy's alma mater MIT?"
    },
    {
        "question": "Has John McCain represented the state of Michigan as US senator? Was John McCain's alma mater MIT?"
    },
    {
        "question": "Has Tom Daschle represented the state of Minnesota as US senator? Was Tom Daschle's alma mater MIT?"
    },
    {
        "question": "Has John McCain represented the state of Mississippi as US senator? Was John McCain's alma mater MIT?"
    },
    {
        "question": "Has Jon Tester represented the state of Montana as US senator? Was Jon Tester's alma mater MIT?"
    },
    {
        "question": "Has Chuck Grassley represented the state of Nebraska as US senator? Was Chuck Grassley's alma mater MIT?"
    },
    {
        "question": "Has Harry Reid represented the state of Nevada as US senator? Was Harry Reid's alma mater MIT?"
    },
    {
        "question": "Has Orrin Hatch represented the state of New Mexico as US senator? Was Orrin Hatch's alma mater MIT?"
    },
    {
        "question": "Has Chuck Schumer represented the state of New York as US senator? Was Chuck Schumer's alma mater MIT?"
    },
    {
        "question": "Has Thom Tillis represented the state of North Carolina as US senator? Was Thom Tillis's alma mater MIT?"
    },
    {
        "question": "Has Byron Moore represented the state of North Dakota as US senator? Was Byron Moore's alma mater MIT?"
    },
    {
        "question": "Has Tom Coburn represented the state of Oklahoma as US senator? Was Tom Coburn's alma mater MIT?"
    },
    {
        "question": "Has Gordon Smith represented the state of Oregon as US senator? Was Gordon Smith's alma mater MIT?"
    },
    {
        "question": "Has Rick Santorum represented the state of Pennsylvania as US senator? Was Rick Santorum's alma mater MIT?"
    },
    {
        "question": "Has Lincoln Chafee represented the state of Rhode Island as US senator? Was Lincoln Chafee's alma mater MIT?"
    },
    {
        "question": "Has Mike Rounds represented the state of South Dakota as US senator? Was Mike Rounds's alma mater MIT?"
    },
    {
        "question": "Has Tom Harkin represented the state of Tennessee as US senator? Was Tom Harkin's alma mater MIT?"
    },
    {
        "question": "Has Orrin Hatch represented the state of Utah as US senator? Was Orrin Hatch's alma mater MIT?"
    },
    {
        "question": "Has Bernie Sanders represented the state of Vermont as US senator? Was Bernie Sanders's alma mater MIT?"
    },
    {
        "question": "Has John Warner represented the state of Virginia as US senator? Was John Warner's alma mater MIT?"
    },
    {
        "question": "Has Ron Wyden represented the state of Washington as US senator? Was Ron Wyden's alma mater MIT?"
    },
    {
        "question": "Has Robert C. Byrd represented the state of West Virginia as US senator? Was Robert C. Byrd's alma mater MIT?"
    },
    {
        "question": "Has Ron Paul represented the state of Wisconsin as US senator? Was Ron Paul's alma mater MIT?"
    },
    {
        "question": "Has John Snow represented the state of Wyoming as US senator? Was John Snow's alma mater MIT?"
    },
    {
        "question": "Has Robert C represented the state of Alabama as US senator? Was Robert C's alma mater University of Chicago?"
    },
    {
        "question": "Has John McCain represented the state of Arizona as US senator? Was John McCain's alma mater University of Chicago?"
    },
    {
        "question": "Has Tom Cob represented the state of Arkansas as US senator? Was Tom Cob's alma mater University of Chicago?"
    },
    {
        "question": "Has Barbara Boxer represented the state of California as US senator? Was Barbara Boxer's alma mater University of Chicago?"
    },
    {
        "question": "Has Orrin represented the state of Colorado as US senator? Was Orrin's alma mater University of Chicago?"
    },
    {
        "question": "Has John McCain represented the state of Delaware as US senator? Was John McCain's alma mater University of Chicago?"
    },
    {
        "question": "Has John McCain represented the state of Florida as US senator? Was John McCain's alma mater University of Chicago?"
    },
    {
        "question": "Has John McCain represented the state of Georgia as US senator? Was John McCain's alma mater University of Chicago?"
    },
    {
        "question": "Has Harry Reid represented the state of Hawaii as US senator? Was Harry Reid's alma mater University of Chicago?"
    },
    {
        "question": "Has Steve Ur represented the state of Idaho as US senator? Was Steve Ur's alma mater University of Chicago?"
    },
    {
        "question": "Has John G. Carlisle represented the state of Kentucky as US senator? Was John G. Carlisle's alma mater University of Chicago?"
    },
    {
        "question": "Has John McCain represented the state of Louisiana as US senator? Was John McCain's alma mater University of Chicago?"
    },
    {
        "question": "Has Angus King represented the state of Maine as US senator? Was Angus King's alma mater University of Chicago?"
    },
    {
        "question": "Has Robert C represented the state of Maryland as US senator? Was Robert C's alma mater University of Chicago?"
    },
    {
        "question": "Has Elizabeth Warren represented the state of Massachusetts as US senator? Was Elizabeth Warren's alma mater University of Chicago?"
    },
    {
        "question": "Has John McCain represented the state of Michigan as US senator? Was John McCain's alma mater University of Chicago?"
    },
    {
        "question": "Has John McCain represented the state of Mississippi as US senator? Was John McCain's alma mater University of Chicago?"
    },
    {
        "question": "Has Harry Reid represented the state of Nevada as US senator? Was Harry Reid's alma mater University of Chicago?"
    },
    {
        "question": "Has John represented the state of New Hampshire as US senator? Was John's alma mater University of Chicago?"
    },
    {
        "question": "Has Or represented the state of New Mexico as US senator? Was Or's alma mater University of Chicago?"
    },
    {
        "question": "Has Chuck Schumer represented the state of New York as US senator? Was Chuck Schumer's alma mater University of Chicago?"
    },
    {
        "question": "Has John represented the state of North Carolina as US senator? Was John's alma mater University of Chicago?"
    },
    {
        "question": "Has Harry Reid represented the state of Ohio as US senator? Was Harry Reid's alma mater University of Chicago?"
    },
    {
        "question": "Has Orrin represented the state of Oklahoma as US senator? Was Orrin's alma mater University of Chicago?"
    },
    {
        "question": "Has Ron W represented the state of Oregon as US senator? Was Ron W's alma mater University of Chicago?"
    },
    {
        "question": "Has Jack Reed represented the state of Rhode Island as US senator? Was Jack Reed's alma mater University of Chicago?"
    },
    {
        "question": "Has Tom H represented the state of Tennessee as US senator? Was Tom H's alma mater University of Chicago?"
    },
    {
        "question": "Has Robert Menendez represented the state of Texas as US senator? Was Robert Menendez's alma mater University of Chicago?"
    },
    {
        "question": "Has Orrin Hatch represented the state of Utah as US senator? Was Orrin Hatch's alma mater University of Chicago?"
    },
    {
        "question": "Has Maria Cantwell represented the state of Washington as US senator? Was Maria Cantwell's alma mater University of Chicago?"
    },
    {
        "question": "Has Robert represented the state of West Virginia as US senator? Was Robert's alma mater University of Chicago?"
    },
    {
        "question": "Has Ron Paul represented the state of Wisconsin as US senator? Was Ron Paul's alma mater University of Chicago?"
    },
    {
        "question": "Has John McCain represented the state of Wyoming as US senator? Was John McCain's alma mater University of Chicago?"
    },
    {
        "question": "Has Robert C. Byrd represented the state of Alabama as US senator? Was Robert C. Byrd's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John McCain represented the state of Alaska as US senator? Was John McCain's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John McCain represented the state of Arizona as US senator? Was John McCain's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Tom Cob represented the state of Arkansas as US senator? Was Tom Cob's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Barbara Boxer represented the state of California as US senator? Was Barbara Boxer's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Orrin Hatch represented the state of Colorado as US senator? Was Orrin Hatch's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Chris Dodd represented the state of Connecticut as US senator? Was Chris Dodd's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Joe Biden represented the state of Delaware as US senator? Was Joe Biden's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John McCain represented the state of Florida as US senator? Was John McCain's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Daniel Inouye represented the state of Hawaii as US senator? Was Daniel Inouye's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Steve Ur represented the state of Idaho as US senator? Was Steve Ur's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Barack Obama represented the state of Illinois as US senator? Was Barack Obama's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Evan Bayh represented the state of Indiana as US senator? Was Evan Bayh's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Tom Harkin represented the state of Iowa as US senator? Was Tom Harkin's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Robert H represented the state of Kansas as US senator? Was Robert H's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John Sherman Cooper represented the state of Kentucky as US senator? Was John Sherman Cooper's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John Ch represented the state of Louisiana as US senator? Was John Ch's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has George J. Mitchell represented the state of Maine as US senator? Was George J. Mitchell's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John T. Morgan represented the state of Massachusetts as US senator? Was John T. Morgan's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John McCain represented the state of Michigan as US senator? Was John McCain's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John Ch represented the state of Minnesota as US senator? Was John Ch's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John McCain represented the state of Mississippi as US senator? Was John McCain's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Robert C represented the state of Missouri as US senator? Was Robert C's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Jon Tester represented the state of Montana as US senator? Was Jon Tester's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Ben Nelson represented the state of Nebraska as US senator? Was Ben Nelson's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Harry Reid represented the state of Nevada as US senator? Was Harry Reid's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John represented the state of New Hampshire as US senator? Was John's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Cory Booker represented the state of New Jersey as US senator? Was Cory Booker's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Robert represented the state of New Mexico as US senator? Was Robert's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Daniel Patrick Moynihan represented the state of New York as US senator? Was Daniel Patrick Moynihan's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John represented the state of North Carolina as US senator? Was John's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John represented the state of North Dakota as US senator? Was John's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John H. Glenn Jr represented the state of Ohio as US senator? Was John H. Glenn Jr's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Tom Coburn represented the state of Oklahoma as US senator? Was Tom Coburn's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Ron W represented the state of Oregon as US senator? Was Ron W's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John H. Mellon represented the state of Pennsylvania as US senator? Was John H. Mellon's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Joseph represented the state of Rhode Island as US senator? Was Joseph's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Fritz Hollings represented the state of South Carolina as US senator? Was Fritz Hollings's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John represented the state of South Dakota as US senator? Was John's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Tom H represented the state of Tennessee as US senator? Was Tom H's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John Cornyn represented the state of Texas as US senator? Was John Cornyn's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Orrin Hatch represented the state of Utah as US senator? Was Orrin Hatch's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Patrick Leahy represented the state of Vermont as US senator? Was Patrick Leahy's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John Warner represented the state of Virginia as US senator? Was John Warner's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Ron W represented the state of Washington as US senator? Was Ron W's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has Robert represented the state of West Virginia as US senator? Was Robert's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John Snow represented the state of Wyoming as US senator? Was John Snow's alma mater Johns Hopkins University?"
    },
    {
        "question": "Has John McCain represented the state of Arizona as US senator? Was John McCain's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Tom Cob represented the state of Arkansas as US senator? Was Tom Cob's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Barbara Boxer represented the state of California as US senator? Was Barbara Boxer's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Orrin Hatch represented the state of Colorado as US senator? Was Orrin Hatch's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Joseph Lieberman represented the state of Connecticut as US senator? Was Joseph Lieberman's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has John McCain represented the state of Florida as US senator? Was John McCain's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has John Heinz represented the state of Illinois as US senator? Was John Heinz's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Joe Donnelly represented the state of Indiana as US senator? Was Joe Donnelly's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Tom Harkin represented the state of Iowa as US senator? Was Tom Harkin's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has George Vo represented the state of Kansas as US senator? Was George Vo's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Rand Paul represented the state of Kentucky as US senator? Was Rand Paul's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has John S. McKernan Jr represented the state of Maine as US senator? Was John S. McKernan Jr's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has John Heinz represented the state of Massachusetts as US senator? Was John Heinz's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Robert Menendez represented the state of Michigan as US senator? Was Robert Menendez's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Charles A. Lindbergh represented the state of Minnesota as US senator? Was Charles A. Lindbergh's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Robert C represented the state of Missouri as US senator? Was Robert C's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Jon Tester represented the state of Montana as US senator? Was Jon Tester's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Harry Reid represented the state of Nevada as US senator? Was Harry Reid's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has John represented the state of New Hampshire as US senator? Was John's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Robert represented the state of New Mexico as US senator? Was Robert's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has John H. Chafee represented the state of New York as US senator? Was John H. Chafee's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has John represented the state of North Carolina as US senator? Was John's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has John represented the state of North Dakota as US senator? Was John's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Tom Cob represented the state of Oklahoma as US senator? Was Tom Cob's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Ron Wyden represented the state of Oregon as US senator? Was Ron Wyden's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Lincoln represented the state of Rhode Island as US senator? Was Lincoln's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Robert represented the state of South Carolina as US senator? Was Robert's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has John represented the state of South Dakota as US senator? Was John's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has John Corn represented the state of Texas as US senator? Was John Corn's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Mike Lee represented the state of Utah as US senator? Was Mike Lee's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Jim Jeffords represented the state of Vermont as US senator? Was Jim Jeffords's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Tom H represented the state of Washington as US senator? Was Tom H's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Robert represented the state of West Virginia as US senator? Was Robert's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Joseph McCarthy represented the state of Wisconsin as US senator? Was Joseph McCarthy's alma mater University of Pennsylvania?"
    },
    {
        "question": "Has Robert represented the state of Alabama as US senator? Was Robert's alma mater California Institute of Technology?"
    },
    {
        "question": "Has John represented the state of Alaska as US senator? Was John's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Tom represented the state of Arkansas as US senator? Was Tom's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Or represented the state of Colorado as US senator? Was Or's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Joe represented the state of Connecticut as US senator? Was Joe's alma mater California Institute of Technology?"
    },
    {
        "question": "Has John represented the state of Delaware as US senator? Was John's alma mater California Institute of Technology?"
    },
    {
        "question": "Has John represented the state of Florida as US senator? Was John's alma mater California Institute of Technology?"
    },
    {
        "question": "Has John represented the state of Georgia as US senator? Was John's alma mater California Institute of Technology?"
    },
    {
        "question": "Has John represented the state of Hawaii as US senator? Was John's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Ron represented the state of Idaho as US senator? Was Ron's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Paul Simon represented the state of Illinois as US senator? Was Paul Simon's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Richard represented the state of Indiana as US senator? Was Richard's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Tom represented the state of Iowa as US senator? Was Tom's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Chuck represented the state of Kansas as US senator? Was Chuck's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Richard represented the state of Kentucky as US senator? Was Richard's alma mater California Institute of Technology?"
    },
    {
        "question": "Has John represented the state of Louisiana as US senator? Was John's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Susan Collins represented the state of Maine as US senator? Was Susan Collins's alma mater California Institute of Technology?"
    },
    {
        "question": "Has John represented the state of Michigan as US senator? Was John's alma mater California Institute of Technology?"
    },
    {
        "question": "Has John represented the state of Minnesota as US senator? Was John's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Robert represented the state of Mississippi as US senator? Was Robert's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Robert represented the state of Missouri as US senator? Was Robert's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Jon represented the state of Montana as US senator? Was Jon's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Chuck represented the state of Nebraska as US senator? Was Chuck's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Harry Reid represented the state of Nevada as US senator? Was Harry Reid's alma mater California Institute of Technology?"
    },
    {
        "question": "Has John A. Durkin represented the state of New Hampshire as US senator? Was John A. Durkin's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Dianne Feinstein represented the state of New York as US senator? Was Dianne Feinstein's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Heidi Heitkamp represented the state of North Dakota as US senator? Was Heidi Heitkamp's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Robert represented the state of Ohio as US senator? Was Robert's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Tom represented the state of Oklahoma as US senator? Was Tom's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Ron represented the state of Oregon as US senator? Was Ron's alma mater California Institute of Technology?"
    },
    {
        "question": "Has John represented the state of Pennsylvania as US senator? Was John's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Sheldon Whitehouse represented the state of Rhode Island as US senator? Was Sheldon Whitehouse's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Tim Scott represented the state of South Carolina as US senator? Was Tim Scott's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Richard represented the state of Tennessee as US senator? Was Richard's alma mater California Institute of Technology?"
    },
    {
        "question": "Has John represented the state of Texas as US senator? Was John's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Orrin Hatch represented the state of Utah as US senator? Was Orrin Hatch's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Bernie Sanders represented the state of Vermont as US senator? Was Bernie Sanders's alma mater California Institute of Technology?"
    },
    {
        "question": "Has John represented the state of Virginia as US senator? Was John's alma mater California Institute of Technology?"
    },
    {
        "question": "Has John D. Rockefeller IV represented the state of West Virginia as US senator? Was John D. Rockefeller IV's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Ron represented the state of Wisconsin as US senator? Was Ron's alma mater California Institute of Technology?"
    },
    {
        "question": "Has John represented the state of Wyoming as US senator? Was John's alma mater California Institute of Technology?"
    },
    {
        "question": "Has Robert C represented the state of Alabama as US senator? Was Robert C's alma mater Duke University?"
    },
    {
        "question": "Has John McCain represented the state of Arizona as US senator? Was John McCain's alma mater Duke University?"
    },
    {
        "question": "Has Tom Coburn represented the state of Arkansas as US senator? Was Tom Coburn's alma mater Duke University?"
    },
    {
        "question": "Has John McCain represented the state of Georgia as US senator? Was John McCain's alma mater Duke University?"
    },
    {
        "question": "Has Steve Urquhart represented the state of Idaho as US senator? Was Steve Urquhart's alma mater Duke University?"
    },
    {
        "question": "Has John McCain represented the state of Louisiana as US senator? Was John McCain's alma mater Duke University?"
    },
    {
        "question": "Has John McCain represented the state of Michigan as US senator? Was John McCain's alma mater Duke University?"
    },
    {
        "question": "Has Al Franken represented the state of Minnesota as US senator? Was Al Franken's alma mater Duke University?"
    },
    {
        "question": "Has Robert C represented the state of Mississippi as US senator? Was Robert C's alma mater Duke University?"
    },
    {
        "question": "Has Robert C represented the state of Missouri as US senator? Was Robert C's alma mater Duke University?"
    },
    {
        "question": "Has Chuck Grassley represented the state of Nebraska as US senator? Was Chuck Grassley's alma mater Duke University?"
    },
    {
        "question": "Has Orrin represented the state of New Mexico as US senator? Was Orrin's alma mater Duke University?"
    },
    {
        "question": "Has Chuck Schumer represented the state of New York as US senator? Was Chuck Schumer's alma mater Duke University?"
    },
    {
        "question": "Has Kent Conrad represented the state of North Dakota as US senator? Was Kent Conrad's alma mater Duke University?"
    },
    {
        "question": "Has Sheldon Whitehouse represented the state of Rhode Island as US senator? Was Sheldon Whitehouse's alma mater Duke University?"
    },
    {
        "question": "Has Mike Rounds represented the state of South Dakota as US senator? Was Mike Rounds's alma mater Duke University?"
    },
    {
        "question": "Has John Snow represented the state of Wyoming as US senator? Was John Snow's alma mater Duke University?"
    },
    {
        "question": "Has John McCain represented the state of Alaska as US senator? Was John McCain's alma mater Northwestern University?"
    },
    {
        "question": "Has John McCain represented the state of Arizona as US senator? Was John McCain's alma mater Northwestern University?"
    },
    {
        "question": "Has Orrin Hatch represented the state of Colorado as US senator? Was Orrin Hatch's alma mater Northwestern University?"
    },
    {
        "question": "Has Bill Nelson represented the state of Florida as US senator? Was Bill Nelson's alma mater Northwestern University?"
    },
    {
        "question": "Has John McCain represented the state of Georgia as US senator? Was John McCain's alma mater Northwestern University?"
    },
    {
        "question": "Has Charles H. McCulloch represented the state of Iowa as US senator? Was Charles H. McCulloch's alma mater Northwestern University?"
    },
    {
        "question": "Has Chuck Grassley represented the state of Kansas as US senator? Was Chuck Grassley's alma mater Northwestern University?"
    },
    {
        "question": "Has John McCain represented the state of Louisiana as US senator? Was John McCain's alma mater Northwestern University?"
    },
    {
        "question": "Has John McCain represented the state of Mississippi as US senator? Was John McCain's alma mater Northwestern University?"
    },
    {
        "question": "Has Robert C represented the state of Missouri as US senator? Was Robert C's alma mater Northwestern University?"
    },
    {
        "question": "Has Jon Tester represented the state of Montana as US senator? Was Jon Tester's alma mater Northwestern University?"
    },
    {
        "question": "Has Harry Reid represented the state of Nevada as US senator? Was Harry Reid's alma mater Northwestern University?"
    },
    {
        "question": "Has Jeanne Shaheen represented the state of New Hampshire as US senator? Was Jeanne Shaheen's alma mater Northwestern University?"
    },
    {
        "question": "Has Frank Lautenberg represented the state of New Jersey as US senator? Was Frank Lautenberg's alma mater Northwestern University?"
    },
    {
        "question": "Has Orrin represented the state of New Mexico as US senator? Was Orrin's alma mater Northwestern University?"
    },
    {
        "question": "Has Charles W. Yates represented the state of New York as US senator? Was Charles W. Yates's alma mater Northwestern University?"
    },
    {
        "question": "Has John McCain represented the state of North Carolina as US senator? Was John McCain's alma mater Northwestern University?"
    },
    {
        "question": "Has Joe Donnelly represented the state of Ohio as US senator? Was Joe Donnelly's alma mater Northwestern University?"
    },
    {
        "question": "Has Tom Coburn represented the state of Oklahoma as US senator? Was Tom Coburn's alma mater Northwestern University?"
    },
    {
        "question": "Has Ron Wyden represented the state of Oregon as US senator? Was Ron Wyden's alma mater Northwestern University?"
    },
    {
        "question": "Has Lincoln Chafee represented the state of Rhode Island as US senator? Was Lincoln Chafee's alma mater Northwestern University?"
    },
    {
        "question": "Has Jim DeMint represented the state of South Carolina as US senator? Was Jim DeMint's alma mater Northwestern University?"
    },
    {
        "question": "Has Ted Cruz represented the state of Texas as US senator? Was Ted Cruz's alma mater Northwestern University?"
    },
    {
        "question": "Has Robert C. Byrd represented the state of West Virginia as US senator? Was Robert C. Byrd's alma mater Northwestern University?"
    },
    {
        "question": "Has Tammy Baldwin represented the state of Wisconsin as US senator? Was Tammy Baldwin's alma mater Northwestern University?"
    },
    {
        "question": "Has John Snow represented the state of Wyoming as US senator? Was John Snow's alma mater Northwestern University?"
    },
    {
        "question": "Has John McCain represented the state of Arizona as US senator? Was John McCain's alma mater Dartmouth College?"
    },
    {
        "question": "Has Tom Coburn represented the state of Arkansas as US senator? Was Tom Coburn's alma mater Dartmouth College?"
    },
    {
        "question": "Has Barbara Boxer represented the state of California as US senator? Was Barbara Boxer's alma mater Dartmouth College?"
    },
    {
        "question": "Has Chris Murphy represented the state of Connecticut as US senator? Was Chris Murphy's alma mater Dartmouth College?"
    },
    {
        "question": "Has John McCain represented the state of Delaware as US senator? Was John McCain's alma mater Dartmouth College?"
    },
    {
        "question": "Has John McCain represented the state of Florida as US senator? Was John McCain's alma mater Dartmouth College?"
    },
    {
        "question": "Has Joseph I represented the state of Hawaii as US senator? Was Joseph I's alma mater Dartmouth College?"
    },
    {
        "question": "Has Steve Daines represented the state of Idaho as US senator? Was Steve Daines's alma mater Dartmouth College?"
    },
    {
        "question": "Has John W. Kern represented the state of Indiana as US senator? Was John W. Kern's alma mater Dartmouth College?"
    },
    {
        "question": "Has Robert A represented the state of Kansas as US senator? Was Robert A's alma mater Dartmouth College?"
    },
    {
        "question": "Has John Chaf represented the state of Louisiana as US senator? Was John Chaf's alma mater Dartmouth College?"
    },
    {
        "question": "Has Robert C represented the state of Mississippi as US senator? Was Robert C's alma mater Dartmouth College?"
    },
    {
        "question": "Has John Danforth represented the state of Missouri as US senator? Was John Danforth's alma mater Dartmouth College?"
    },
    {
        "question": "Has John Chaf represented the state of Montana as US senator? Was John Chaf's alma mater Dartmouth College?"
    },
    {
        "question": "Has John McCain represented the state of Nebraska as US senator? Was John McCain's alma mater Dartmouth College?"
    },
    {
        "question": "Has Harry Reid represented the state of Nevada as US senator? Was Harry Reid's alma mater Dartmouth College?"
    },
    {
        "question": "Has Cory Booker represented the state of New Jersey as US senator? Was Cory Booker's alma mater Dartmouth College?"
    },
    {
        "question": "Has Robert Menendez represented the state of New Mexico as US senator? Was Robert Menendez's alma mater Dartmouth College?"
    },
    {
        "question": "Has Robert C represented the state of North Carolina as US senator? Was Robert C's alma mater Dartmouth College?"
    },
    {
        "question": "Has Orrin Hatch represented the state of Oklahoma as US senator? Was Orrin Hatch's alma mater Dartmouth College?"
    },
    {
        "question": "Has Ron Wyden represented the state of Oregon as US senator? Was Ron Wyden's alma mater Dartmouth College?"
    },
    {
        "question": "Has Robert C represented the state of South Carolina as US senator? Was Robert C's alma mater Dartmouth College?"
    },
    {
        "question": "Has Robert Menendez represented the state of Texas as US senator? Was Robert Menendez's alma mater Dartmouth College?"
    },
    {
        "question": "Has Orrin Hatch represented the state of Utah as US senator? Was Orrin Hatch's alma mater Dartmouth College?"
    },
    {
        "question": "Has Robert C. Byrd represented the state of West Virginia as US senator? Was Robert C. Byrd's alma mater Dartmouth College?"
    },
    {
        "question": "Has William H. Seward represented the state of Wisconsin as US senator? Was William H. Seward's alma mater Dartmouth College?"
    },
    {
        "question": "Has John Snow represented the state of Wyoming as US senator? Was John Snow's alma mater Dartmouth College?"
    },
    {
        "question": "Has Robert C represented the state of Alabama as US senator? Was Robert C's alma mater Brown University?"
    },
    {
        "question": "Has Ted Kennedy represented the state of Alaska as US senator? Was Ted Kennedy's alma mater Brown University?"
    },
    {
        "question": "Has John McCain represented the state of Arizona as US senator? Was John McCain's alma mater Brown University?"
    },
    {
        "question": "Has Tom Coburn represented the state of Arkansas as US senator? Was Tom Coburn's alma mater Brown University?"
    },
    {
        "question": "Has Barbara Boxer represented the state of California as US senator? Was Barbara Boxer's alma mater Brown University?"
    },
    {
        "question": "Has John McCain represented the state of Georgia as US senator? Was John McCain's alma mater Brown University?"
    },
    {
        "question": "Has Barack Obama represented the state of Illinois as US senator? Was Barack Obama's alma mater Brown University?"
    },
    {
        "question": "Has Orrin Hatch represented the state of Kansas as US senator? Was Orrin Hatch's alma mater Brown University?"
    },
    {
        "question": "Has Robert C represented the state of Mississippi as US senator? Was Robert C's alma mater Brown University?"
    },
    {
        "question": "Has Jon Tester represented the state of Montana as US senator? Was Jon Tester's alma mater Brown University?"
    },
    {
        "question": "Has Harry Reid represented the state of Nevada as US senator? Was Harry Reid's alma mater Brown University?"
    },
    {
        "question": "Has Orrin represented the state of New Mexico as US senator? Was Orrin's alma mater Brown University?"
    },
    {
        "question": "Has Roy Cooper represented the state of North Carolina as US senator? Was Roy Cooper's alma mater Brown University?"
    },
    {
        "question": "Has Kent Conrad represented the state of North Dakota as US senator? Was Kent Conrad's alma mater Brown University?"
    },
    {
        "question": "Has Tom Coburn represented the state of Oklahoma as US senator? Was Tom Coburn's alma mater Brown University?"
    },
    {
        "question": "Has Ron Wyden represented the state of Oregon as US senator? Was Ron Wyden's alma mater Brown University?"
    },
    {
        "question": "Has Robert C represented the state of South Carolina as US senator? Was Robert C's alma mater Brown University?"
    },
    {
        "question": "Has Tim Johnson represented the state of South Dakota as US senator? Was Tim Johnson's alma mater Brown University?"
    },
    {
        "question": "Has Tom Harkin represented the state of Tennessee as US senator? Was Tom Harkin's alma mater Brown University?"
    },
    {
        "question": "Has John McCain represented the state of Texas as US senator? Was John McCain's alma mater Brown University?"
    },
    {
        "question": "Has Orrin Hatch represented the state of Utah as US senator? Was Orrin Hatch's alma mater Brown University?"
    },
    {
        "question": "Has Ron Wyden represented the state of Washington as US senator? Was Ron Wyden's alma mater Brown University?"
    },
    {
        "question": "Has Robert C. Byrd represented the state of West Virginia as US senator? Was Robert C. Byrd's alma mater Brown University?"
    },
    {
        "question": "Has John Snow represented the state of Wyoming as US senator? Was John Snow's alma mater Brown University?"
    },
    {
        "question": "Has Ted Kennedy represented the state of Alaska as US senator? Was Ted Kennedy's alma mater Vanderbilt University?"
    },
    {
        "question": "Has John McCain represented the state of Arizona as US senator? Was John McCain's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Orrin Hatch represented the state of Colorado as US senator? Was Orrin Hatch's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Joe Biden represented the state of Delaware as US senator? Was Joe Biden's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Harry Reid represented the state of Hawaii as US senator? Was Harry Reid's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Steve Urqu represented the state of Idaho as US senator? Was Steve Urqu's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Barack Obama represented the state of Illinois as US senator? Was Barack Obama's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Joe Donnelly represented the state of Indiana as US senator? Was Joe Donnelly's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Tom Harkin represented the state of Iowa as US senator? Was Tom Harkin's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Orrin Hatch represented the state of Kansas as US senator? Was Orrin Hatch's alma mater Vanderbilt University?"
    },
    {
        "question": "Has John A. Durkin represented the state of Maine as US senator? Was John A. Durkin's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Benjamin L. Cardin represented the state of Maryland as US senator? Was Benjamin L. Cardin's alma mater Vanderbilt University?"
    },
    {
        "question": "Has John McCain represented the state of Minnesota as US senator? Was John McCain's alma mater Vanderbilt University?"
    },
    {
        "question": "Has John McCain represented the state of Nebraska as US senator? Was John McCain's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Harry Reid represented the state of Nevada as US senator? Was Harry Reid's alma mater Vanderbilt University?"
    },
    {
        "question": "Has John McCain represented the state of New Hampshire as US senator? Was John McCain's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Bill Bradley represented the state of New Jersey as US senator? Was Bill Bradley's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Orrin represented the state of New Mexico as US senator? Was Orrin's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Joseph E. Brown represented the state of North Carolina as US senator? Was Joseph E. Brown's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Kent Conrad represented the state of North Dakota as US senator? Was Kent Conrad's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Orrin Hatch represented the state of Oklahoma as US senator? Was Orrin Hatch's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Ron Wyden represented the state of Oregon as US senator? Was Ron Wyden's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Jim DeMint represented the state of South Carolina as US senator? Was Jim DeMint's alma mater Vanderbilt University?"
    },
    {
        "question": "Has David Sanders represented the state of South Dakota as US senator? Was David Sanders's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Robert C represented the state of Texas as US senator? Was Robert C's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Orrin Hatch represented the state of Utah as US senator? Was Orrin Hatch's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Maria Cantwell represented the state of Washington as US senator? Was Maria Cantwell's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Robert C. Byrd represented the state of West Virginia as US senator? Was Robert C. Byrd's alma mater Vanderbilt University?"
    },
    {
        "question": "Has John McCain represented the state of Wyoming as US senator? Was John McCain's alma mater Vanderbilt University?"
    },
    {
        "question": "Has Robert C represented the state of Alabama as US senator? Was Robert C's alma mater Rice University?"
    },
    {
        "question": "Has John McCain represented the state of Arizona as US senator? Was John McCain's alma mater Rice University?"
    },
    {
        "question": "Has Tom Coburn represented the state of Arkansas as US senator? Was Tom Coburn's alma mater Rice University?"
    },
    {
        "question": "Has Barbara Boxer represented the state of California as US senator? Was Barbara Boxer's alma mater Rice University?"
    },
    {
        "question": "Has John McCain represented the state of Delaware as US senator? Was John McCain's alma mater Rice University?"
    },
    {
        "question": "Has John McCain represented the state of Florida as US senator? Was John McCain's alma mater Rice University?"
    },
    {
        "question": "Has John McCain represented the state of Georgia as US senator? Was John McCain's alma mater Rice University?"
    },
    {
        "question": "Has Charles Schumer represented the state of Hawaii as US senator? Was Charles Schumer's alma mater Rice University?"
    },
    {
        "question": "Has Barack Obama represented the state of Illinois as US senator? Was Barack Obama's alma mater Rice University?"
    },
    {
        "question": "Has Chuck Grassley represented the state of Kansas as US senator? Was Chuck Grassley's alma mater Rice University?"
    },
    {
        "question": "Has John Yarmuth represented the state of Kentucky as US senator? Was John Yarmuth's alma mater Rice University?"
    },
    {
        "question": "Has John McCain represented the state of Louisiana as US senator? Was John McCain's alma mater Rice University?"
    },
    {
        "question": "Has John McCain represented the state of Michigan as US senator? Was John McCain's alma mater Rice University?"
    },
    {
        "question": "Has John McCain represented the state of Mississippi as US senator? Was John McCain's alma mater Rice University?"
    },
    {
        "question": "Has Robert C represented the state of Missouri as US senator? Was Robert C's alma mater Rice University?"
    },
    {
        "question": "Has Harry Reid represented the state of Nevada as US senator? Was Harry Reid's alma mater Rice University?"
    },
    {
        "question": "Has John McCain represented the state of New Hampshire as US senator? Was John McCain's alma mater Rice University?"
    },
    {
        "question": "Has Robert Menendez represented the state of New Jersey as US senator? Was Robert Menendez's alma mater Rice University?"
    },
    {
        "question": "Has Orrin Hatch represented the state of New Mexico as US senator? Was Orrin Hatch's alma mater Rice University?"
    },
    {
        "question": "Has Chuck Schumer represented the state of New York as US senator? Was Chuck Schumer's alma mater Rice University?"
    },
    {
        "question": "Has Thom Tillis represented the state of North Carolina as US senator? Was Thom Tillis's alma mater Rice University?"
    },
    {
        "question": "Has John McCain represented the state of North Dakota as US senator? Was John McCain's alma mater Rice University?"
    },
    {
        "question": "Has Tom Coburn represented the state of Oklahoma as US senator? Was Tom Coburn's alma mater Rice University?"
    },
    {
        "question": "Has Ron Wyden represented the state of Oregon as US senator? Was Ron Wyden's alma mater Rice University?"
    },
    {
        "question": "Has Lincoln Chafee represented the state of Rhode Island as US senator? Was Lincoln Chafee's alma mater Rice University?"
    },
    {
        "question": "Has Tom Daschle represented the state of South Dakota as US senator? Was Tom Daschle's alma mater Rice University?"
    },
    {
        "question": "Has John Cornyn represented the state of Texas as US senator? Was John Cornyn's alma mater Rice University?"
    },
    {
        "question": "Has Orrin Hatch represented the state of Utah as US senator? Was Orrin Hatch's alma mater Rice University?"
    },
    {
        "question": "Has John Warner represented the state of Virginia as US senator? Was John Warner's alma mater Rice University?"
    },
    {
        "question": "Has Robert C represented the state of West Virginia as US senator? Was Robert C's alma mater Rice University?"
    },
    {
        "question": "Has Russ Feingold represented the state of Wisconsin as US senator? Was Russ Feingold's alma mater Rice University?"
    },
    {
        "question": "Has John Snow represented the state of Wyoming as US senator? Was John Snow's alma mater Rice University?"
    },
    {
        "question": "Has Robert C represented the state of Alabama as US senator? Was Robert C's alma mater University of Washington?"
    },
    {
        "question": "Has John McCain represented the state of Arizona as US senator? Was John McCain's alma mater University of Washington?"
    },
    {
        "question": "Has Tom Cob represented the state of Arkansas as US senator? Was Tom Cob's alma mater University of Washington?"
    },
    {
        "question": "Has Barbara Boxer represented the state of California as US senator? Was Barbara Boxer's alma mater University of Washington?"
    },
    {
        "question": "Has Orrin represented the state of Colorado as US senator? Was Orrin's alma mater University of Washington?"
    },
    {
        "question": "Has Edward Kennedy represented the state of Connecticut as US senator? Was Edward Kennedy's alma mater University of Washington?"
    },
    {
        "question": "Has John McCain represented the state of Delaware as US senator? Was John McCain's alma mater University of Washington?"
    },
    {
        "question": "Has John McCain represented the state of Florida as US senator? Was John McCain's alma mater University of Washington?"
    },
    {
        "question": "Has John McCain represented the state of Georgia as US senator? Was John McCain's alma mater University of Washington?"
    },
    {
        "question": "Has John McCain represented the state of Hawaii as US senator? Was John McCain's alma mater University of Washington?"
    },
    {
        "question": "Has Steve Ur represented the state of Idaho as US senator? Was Steve Ur's alma mater University of Washington?"
    },
    {
        "question": "Has Joe Donnelly represented the state of Indiana as US senator? Was Joe Donnelly's alma mater University of Washington?"
    },
    {
        "question": "Has Tom H represented the state of Iowa as US senator? Was Tom H's alma mater University of Washington?"
    },
    {
        "question": "Has Tom H represented the state of Kansas as US senator? Was Tom H's alma mater University of Washington?"
    },
    {
        "question": "Has John Ch represented the state of Louisiana as US senator? Was John Ch's alma mater University of Washington?"
    },
    {
        "question": "Has Olympia Snowe represented the state of Maine as US senator? Was Olympia Snowe's alma mater University of Washington?"
    },
    {
        "question": "Has Robert C represented the state of Maryland as US senator? Was Robert C's alma mater University of Washington?"
    }
]